songs_app_api/app/controllers/songs_controller.rb

    def index
      puts "==========params============="
      puts params
      puts "==========params============="
      render json: {
        status: 200,
        songs: Song.all
---
SELECT "songs".* FROM "songs"

    def show
      # Puts the params hash to server output:
      puts "==========params============="
      puts params
      puts !!params[:stuff]
      puts params[:stuff].present?
      puts "==========params============="
      @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
      puts "==========params============="
      puts params
      puts "==========params============="
      puts "==========song_params============="
      puts song_params
      puts "==========song_params============="
      @song = Song.create(song_params)
---
INSERT INTO "songs" ("title", "artist_name") VALUES ($1, $2) RETURNING "id"  [["title", "The Final Countdown"], ["artist_name", "Europe"]]