dating_app/dating_app_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all.sample(3)

INSERT INTO "users" ("name", "starsign", "age", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test"], ["starsign", "test"], ["age", 0], ["img", "test"], ["created_at", "2020-09-22 03:13:11.874676"], ["updated_at", "2020-09-22 03:13:11.874676"]]
---
  def create
    @user = User.new(user_params)

    if @user.save