books_app_api/app/controllers/books_controller.rb

    def index
        render json: {
            status: 200,
            books: Book.all
---
SELECT "books".* FROM "books"

    def show
        found_book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @book = Book.create(book_params)
---
INSERT INTO "books" ("title", "author", "genre", "publisher", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def update
        @book = Book.find(params[:id])
        @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 101], ["LIMIT", 1]]
UPDATE "books" SET "publish_date" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["publish_date", "2004-12-26"], ["updated_at", "2020-09-21 01:19:29.618815"], ["id", 101]]

    def destroy
        @book = Book.destroy(params[:id])
---
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 101]]