regftr_app_api/app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts"
---
    def index
        puts "=======params======="
        puts params
        puts "=======params======="
        render json: {
            status: 200,
            gifts: Gift.all

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        puts "=======params======="
        puts params
        puts !!params[:stuff]
        puts params[:stuff].present?
        puts "=======params======="
        @gift = Gift.find(params[:id])

INSERT INTO "gifts" ("description", "value", "event", "gift_giver") VALUES ($1, $2, $3, $4) RETURNING "id"  [["description", "Laptop"], ["value", 2000], ["event", "Birthday"], ["gift_giver", "Brother"]]
---
    def create
        puts "=======params======="
        puts params
        puts "=======params======="
        puts "==========gift_params============="
        puts gift_params
        puts "==========gift_params============="
        @gift = Gift.create(gift_params)

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "gifts" SET "value" = $1 WHERE "gifts"."id" = $2  [["value", 30], ["id", 6]]
---
    def update
        puts "=======params======="
        puts params
        puts "=======params======="
        puts "==========gift_params============="
        puts gift_params
        puts "==========gift_params============="
        @gift = Gift.find(params[:id])
        @gift.update(gift_params)

DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 6]]
---
    def destroy
        puts "=======params======="
        puts params
        puts "=======params======="
        puts "==========gift_params============="
        puts gift_params
        puts "==========gift_params============="
        @gift = Gift.destroy(params[:id])